#pragma once
#define _CRT_SECURE_NO_WARNINGS

#include "headers.h"

#include <stdio.h>

static struct weapon sword[5] =   {{"Мечь Света",			 28, 100, 100, 20, 100},
								   {"Кинжал Скрытности",		18, 70, 70, 10, 750},
								   {"Экскалибур",		    35, 200, 200, 25, 10000},
								   {"Стальной двуручный меч",	20, 50, 50, 20, 500},
								   {"Стальной клинок",			15, 45, 45, 12, 350}};

static struct weapon bows[3] = 	  {{"Лук охотника",				5, 40, 40, 300, 230},
								   {"Боевой Лук",				7, 50, 50, 350, 400},
								   {"Лук снайпера",			   15, 30, 30, 400, 700}};

static struct weapon axes[2] =    {{"Топор дровосека",			 8, 40, 40, 10, 150},
								   {"Боевой топор",				13, 45, 45, 13, 300}};

static struct weapon sticks[2] =  {{"Волшебный посох",			 5, 20, 20, 15, 340},
								   {"Пламенный посох",			 5, 20, 20, 15, 340}};

static struct weapon hammers[2] = {{"Двуручный молот",			15, 25, 25, 20, 260},
								   {"Кувалда хаоса",			40, 10, 10, 20, 700}};
